---
layout: post
title: "나를 부탁해!"
date: 2018-12-06-12:00:00
tags: smart_sensor
author: 
---
<amp - 

# 개요
왜 구성하게 되었나?
집을 장시간 비울 경우 혼자 있는 반려동물에게 밥과 물을 줄 수 없음
혼자 남겨진 강아지가 외로워 하거나 심심해 할 수 있음

- 밥먹을시간이되면밥이나오게하는것 (사료를 정해진 시간에 일정량 나오게 하는 것이 관건)
- 강아지가버튼을누르면물이일정량나오게하는것
- 주인 목소리를 녹음해서 특정 상황에 틀어주는 것
- 기타 부가 기능들? (현재 구상중)

 사료의 경우 정해진 시간이 되면 모터에 연결된 톱니바퀴가 돌아가면서 사료 칸막이를 일정시 간동안 오픈 -> 일정량 지급 가능
- 물의 경우 터치 센서나 초음파 센서를 이용하여 강아지가 버튼을 누르거나 가까이 오면 물을 주는 형식
- 주인의 목소리를 녹음하여 특정 상황 발생시 해당하는 목소리 파일 출력

물의 경우 양조절이어려울수있으니칸막이대신다른방식사용
- 물용기에물을담고수압을이용해급수하는구조
- 뚜껑을일정각도회전시켜일정시간동안오픈하면일정량의물이나 오게 됨


# 
